Conf.Simple/src/Catalogs/SUI_НастройкиМобильныхУстройств/SUI_НастройкиМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиМобильныхУстройств</name>
  <attributes>
    <name>РазмерШрифтаЗаголовкаТаблицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифтаОсновнойИнформации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифтаДополнительнойИнформации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШтрифтаОтсутствияВНастройке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналУдачногоСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналПредупреждения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводФакта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнРежимГрупповойРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольGTIN</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьУстаревшиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияДокументовВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьДокументыСоСтатусамиСтрокой</name>
    <comment>Значения разделенные через ;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛоговНаСтранице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияЛоговВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньЛогирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСтекВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <comment>&quot;1С&quot; или &quot;ZPL&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоединенияПринтера</name>
    <comment>&quot;BT&quot; или &quot;WiFi&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MACАдресBTПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPАдресWiFiПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерИспользованиеКомандИнтентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerMessage</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerVariable</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerLength</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольУникальностиСерий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьСерииБезПредупреждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПриУдаленииДубля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МассовоеСканированиеВСериях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СимволыРазелители</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПереносСтрокиКакРазделитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяДлинаСимволовШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДлинаСимволовШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьУстаревшиеЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_НастройкиМобильныхУстройств/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	
	Элементы.НадписьОсновнаяНастройка.Видимость = Ложь;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		УдалятьДокументыСоСтатусамиСписок = Справочники.SUI_НастройкиМобильныхУстройств
			.ПолучитьСписокУдалятьДокументыСоСтатусами(Объект);
		УдалятьДокументыСоСтатусами = СформироватьСтрокуСпискаЗначений(УдалятьДокументыСоСтатусамиСписок, ", ", "Представление");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УдалятьДокументыСоСтатусамиСписок = Справочники.SUI_НастройкиМобильныхУстройств
		.ПолучитьСписокУдалятьДокументыСоСтатусами(Объект);
	УдалятьДокументыСоСтатусами = СформироватьСтрокуСпискаЗначений(УдалятьДокументыСоСтатусамиСписок, ", ", "Представление");
	
	Элементы.НадписьОсновнаяНастройка.Видимость = Объект.ОсновнаяНастройка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНастройкиЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.УдалятьДокументыСоСтатусамиСтрокой = СформироватьСтрокуСпискаЗначений(УдалятьДокументыСоСтатусамиСписок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОфлайнРежимПриИзменении(Элемент)
	
	ОбновитьНастройкиЭлементовФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АппаратныйСканерИспользованиеКомандИнтентовПриИзменении(Элемент)
	
	ОбновитьНастройкиЭлементовФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольУникальностиСерийПриИзменении(Элемент)
	
	Если Объект.КонтрольУникальностиСерий Тогда
		Объект.УдалятьСерииБезПредупреждения = Ложь;
		Объект.ПодтверждениеПриУдаленииДубля = Истина;
	КонецЕсли;
	
	ОбновитьНастройкиЭлементовФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьСерииБезПредупрежденияПриИзменении(Элемент)
	
	Если Объект.УдалятьСерииБезПредупреждения И Объект.ПодтверждениеПриУдаленииДубля Тогда
		Объект.ПодтверждениеПриУдаленииДубля = Ложь;
	КонецЕсли;
	
	ОбновитьНастройкиЭлементовФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПриУдаленииДубляПриИзменении(Элемент)
	
	Если Объект.ПодтверждениеПриУдаленииДубля И Объект.УдалятьСерииБезПредупреждения Тогда
		Объект.УдалятьСерииБезПредупреждения = Ложь;
	КонецЕсли;
	
	ОбновитьНастройкиЭлементовФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МассовоеСканированиеВСерияхПриИзменении(Элемент)
	
	ОбновитьНастройкиЭлементовФормы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьДокументыСоСтатусамиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияВыбора = Новый Структура();
	ПараметрыОткрытияВыбора.Вставить("СписокВыбора", УдалятьДокументыСоСтатусамиСписок);
	ПараметрыОткрытияВыбора.Вставить("ВыборПометкой", Истина);
	ПараметрыОткрытияВыбора.Вставить("Заголовок", НСтр("ru = 'Выберите статусы документов'"));
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("УдалятьДокументыСоСтатусамиСписокЗавершениеВыбора", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.SUI_ВыборИзСписка", ПараметрыОткрытияВыбора, ЭтотОбъект, УникальныйИдентификатор, , , 
		ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	МетаданныеОбъекта = Метаданные.Справочники.SUI_НастройкиМобильныхУстройств;
	
	#Область СтраницаРазмерШрифта
	
	// Шаблон подсказки групп Размер шрифта
	ШаблонПодсказкиРазмерШтрифта = НСтр("ru = 'Минимальное значение %1, максимальное значение %2'");
	
	// РазмерШрифтаЗаголовкаТаблицыПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.РазмерШрифтаЗаголовкаТаблицы;
	Элементы.РазмерШрифтаЗаголовкаТаблицыПолосаРегулирования.МинимальноеЗначение = 
		МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.РазмерШрифтаЗаголовкаТаблицыПолосаРегулирования.МаксимальноеЗначение = 
		МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.РазмерШрифтаЗаголовкаТаблицыПолосаРегулирования.БольшойШаг = 4;
	// ГруппаРазмерШрифтаЗаголовкаТаблицы
	Элементы.ГруппаРазмерШрифтаЗаголовкаТаблицы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаРазмерШрифтаЗаголовкаТаблицы.Подсказка = СтрШаблон(ШаблонПодсказкиРазмерШтрифта,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	// РазмерШрифтаОсновнойИнформацииПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.РазмерШрифтаОсновнойИнформации;
	Элементы.РазмерШрифтаОсновнойИнформацииПолосаРегулирования.МинимальноеЗначение = 
		МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.РазмерШрифтаОсновнойИнформацииПолосаРегулирования.МаксимальноеЗначение = 
		МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.РазмерШрифтаОсновнойИнформацииПолосаРегулирования.БольшойШаг = 4;
	// ГруппаРазмерШрифтаОсновнойИнформации
	Элементы.ГруппаРазмерШрифтаОсновнойИнформации.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаРазмерШрифтаОсновнойИнформации.Подсказка = СтрШаблон(ШаблонПодсказкиРазмерШтрифта,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	// РазмерШрифтаДополнительнойИнформацииПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.РазмерШрифтаДополнительнойИнформации;
	Элементы.РазмерШрифтаДополнительнойИнформацииПолосаРегулирования.МинимальноеЗначение = 
		МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.РазмерШрифтаДополнительнойИнформацииПолосаРегулирования.МаксимальноеЗначение = 
		МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.РазмерШрифтаДополнительнойИнформацииПолосаРегулирования.БольшойШаг = 4;
	// ГруппаРазмерШрифтаДополнительнойИнформации
	Элементы.ГруппаРазмерШрифтаДополнительнойИнформации.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаРазмерШрифтаДополнительнойИнформации.Подсказка = СтрШаблон(ШаблонПодсказкиРазмерШтрифта,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	// РазмерШтрифтаОтсутствияВНастройкеПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.РазмерШтрифтаОтсутствияВНастройке;
	Элементы.РазмерШтрифтаОтсутствияВНастройкеПолосаРегулирования.МинимальноеЗначение = 
		МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.РазмерШтрифтаОтсутствияВНастройкеПолосаРегулирования.МаксимальноеЗначение = 
		МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.РазмерШтрифтаОтсутствияВНастройкеПолосаРегулирования.БольшойШаг = 4;
	// ГруппаРазмерШтрифтаОтсутствияВНастройке
	Элементы.ГруппаРазмерШтрифтаОтсутствияВНастройке.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаРазмерШтрифтаОтсутствияВНастройке.Подсказка = СтрШаблон(ШаблонПодсказкиРазмерШтрифта,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	#КонецОбласти
	
	#Область СтраницаЗвуки
	
	// Шаблон подсказки групп Размер шрифта
	ШаблонПодсказкиЗвуки = НСтр("ru = 'Минимальное значение %1, максимальное значение %2'");
	
	// СигналУдачногоСобытияПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.СигналУдачногоСобытия;
	Элементы.СигналУдачногоСобытияПолосаРегулирования.МинимальноеЗначение = МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.СигналУдачногоСобытияПолосаРегулирования.МаксимальноеЗначение = МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.СигналУдачногоСобытияПолосаРегулирования.БольшойШаг = 2;
	// ГруппаСигналУдачногоСобытия
	Элементы.ГруппаСигналУдачногоСобытия.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаСигналУдачногоСобытия.Подсказка = СтрШаблон(ШаблонПодсказкиЗвуки,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	// СигналПредупрежденияПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.СигналПредупреждения;
	Элементы.СигналПредупрежденияПолосаРегулирования.МинимальноеЗначение = МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.СигналПредупрежденияПолосаРегулирования.МаксимальноеЗначение = МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.СигналПредупрежденияПолосаРегулирования.БольшойШаг = 2;
	// ГруппаСигналПредупреждения
	Элементы.ГруппаСигналПредупреждения.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаСигналПредупреждения.Подсказка = СтрШаблон(ШаблонПодсказкиЗвуки,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	// СигналОшибкиПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.СигналОшибки;
	Элементы.СигналОшибкиПолосаРегулирования.МинимальноеЗначение = МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.СигналОшибкиПолосаРегулирования.МаксимальноеЗначение = МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.СигналОшибкиПолосаРегулирования.БольшойШаг = 2;
	// ГруппаСигналОшибки
	Элементы.ГруппаСигналОшибки.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаСигналОшибки.Подсказка = СтрШаблон(ШаблонПодсказкиЗвуки,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	// СигналУведомленияПолосаРегулирования
	МетаданныеРеквизита = МетаданныеОбъекта.Реквизиты.СигналУведомления;
	Элементы.СигналУведомленияПолосаРегулирования.МинимальноеЗначение = МетаданныеРеквизита.МинимальноеЗначение;
	Элементы.СигналУведомленияПолосаРегулирования.МаксимальноеЗначение = МетаданныеРеквизита.МаксимальноеЗначение;
	Элементы.СигналУведомленияПолосаРегулирования.БольшойШаг = 2;
	// ГруппаСигналУведомления
	Элементы.ГруппаСигналУведомления.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Элементы.ГруппаСигналУведомления.Подсказка = СтрШаблон(ШаблонПодсказкиЗвуки,
		МетаданныеРеквизита.МинимальноеЗначение, МетаданныеРеквизита.МаксимальноеЗначение);
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиЭлементовФормы(ЭлементИсточник = Неопределено)
	
	Элементы.НадписьОсновнаяНастройка.Видимость = Объект.ОсновнаяНастройка;
	
	// ОфлайнРежим
	Если ЭлементИсточник = Неопределено Или ЭлементИсточник = Элементы.ОфлайнРежим Тогда
		
		Элементы.ОфлайнРежимГрупповойРаботы.Доступность = Не Объект.ОфлайнРежим;
		Элементы.ОтключитьОбмен.Доступность = Не Объект.ОфлайнРежим;
		
	КонецЕсли;
	
	// АппаратныйСканерИспользованиеКомандИнтентов
	Если ЭлементИсточник = Неопределено Или ЭлементИсточник = Элементы.АппаратныйСканерИспользованиеКомандИнтентов Тогда
		
		Если Объект.АппаратныйСканерИспользованиеКомандИнтентов Тогда
			
			Элементы.ГруппаНастройкиКомандСканераКоманды.Доступность = Истина;
			
			Элементы.АппаратныйСканерIntentScannerMessage.АвтоОтметкаНезаполненного = Истина;
			Элементы.АппаратныйСканерIntentScannerVariable.АвтоОтметкаНезаполненного = Истина;
			
		Иначе
			
			Элементы.ГруппаНастройкиКомандСканераКоманды.Доступность = Ложь;
			
			Элементы.АппаратныйСканерIntentScannerMessage.АвтоОтметкаНезаполненного = Неопределено;
			Элементы.АппаратныйСканерIntentScannerVariable.АвтоОтметкаНезаполненного = Неопределено;
			
			Элементы.АппаратныйСканерIntentScannerMessage.ОтметкаНезаполненного = Ложь;
			Элементы.АппаратныйСканерIntentScannerVariable.ОтметкаНезаполненного = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// КонтрольУникальностиСерий
	Если ЭлементИсточник = Неопределено Или ЭлементИсточник = Элементы.КонтрольУникальностиСерий Или
		ЭлементИсточник = Элементы.ПодтверждениеПриУдаленииДубля Или 
		ЭлементИсточник = Элементы.УдалятьСерииБезПредупреждения Тогда
		
		Элементы.УдалятьСерииБезПредупреждения.Доступность = 
			Объект.КонтрольУникальностиСерий И Не Объект.ПодтверждениеПриУдаленииДубля;
		Элементы.ПодтверждениеПриУдаленииДубля.Доступность = 
			Объект.КонтрольУникальностиСерий И Не Объект.УдалятьСерииБезПредупреждения;
		
	КонецЕсли;
	
	// ОфлайнРежим
	Если ЭлементИсточник = Неопределено Или ЭлементИсточник = Элементы.МассовоеСканированиеВСериях Тогда
		
		Элементы.СимволыРазелители.Доступность = Объект.МассовоеСканированиеВСериях;
		Элементы.ИспользоватьПереносСтрокиКакРазделитель.Доступность = Объект.МассовоеСканированиеВСериях;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьДокументыСоСтатусамиСписокЗавершениеВыбора(СписокВыбора, ДополнительныеПараметры) Экспорт
	
	Если СписокВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалятьДокументыСоСтатусамиСписок = СписокВыбора;
	УдалятьДокументыСоСтатусами = СформироватьСтрокуСпискаЗначений(УдалятьДокументыСоСтатусамиСписок, ", ", "Представление");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтрокуСпискаЗначений(Список, Разделитель = ";", 
	КолонкаПредставления = "Значение", ТолькоСПометкой = Истина)
	
	Представления = Новый Массив();
	
	Для Каждого ЭлементСписка Из Список Цикл
		
		Если Не ТолькоСПометкой Или (ТолькоСПометкой И ЭлементСписка.Пометка) Тогда
			Представления.Добавить(ЭлементСписка[КолонкаПредставления]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Представления, Разделитель);
	
КонецФункции

#КонецОбласти
